src/Reports/ОтчетОСуммахВходящихНалоговыхДокументов/ОтчетОСуммахВходящихНалоговыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОСуммахВходящихНалоговыхДокументов</name>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ОжидаемыйИПодтвержденныйНДСПриобретений/ОжидаемыйИПодтвержденныйНДСПриобретений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОжидаемыйИПодтвержденныйНДСПриобретений</name>
  <comment>(Регл) </comment>
  <resources>
    <name>БазаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСПропорционально</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СобытиеНДС</name>
    <type>
      <types>EnumRef.СобытияОжидаемыйИПодтвержденныйНДСПриобретений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Амортизируется</name>
    <comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ОтчетОСуммахВходящихНалоговыхДокументов/ObjectModule.bsl
#Если Клиент Тогда

// Выполняет настройку отчета по умолчанию.
// 
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "НДСПриобретений";
	УниверсальныйОтчет.ИмяРегистра = "";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	//УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	// При написании текста запроса рекомендуется следовать правилам, описанным в следующем шаблоне текста запроса:
	//
	//ВЫБРАТЬ
	//	<ПсевдонимТаблицы.Поле> КАК <ПсевдонимПоля>,
	//	ПРЕДСТАВЛЕНИЕ(<ПсевдонимТаблицы>.<Поле>),
	//	<ПсевдонимТаблицы.Показатель> КАК <ПсевдонимПоказателя>
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//{ВЫБРАТЬ
	//	<ПсевдонимПоля>.*,
	//	<ПсевдонимПоказателя>,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//ИЗ
	//	<Таблица> КАК <ПсевдонимТаблицы>
	//	//СОЕДИНЕНИЯ
	//{ГДЕ
	//	<ПсевдонимТаблицы.Поле>.* КАК <ПсевдонимПоля>,
	//	<ПсевдонимТаблицы.Показатель> КАК <ПсевдонимПоказателя>,
	//	<ПсевдонимТаблицы>.Регистратор КАК Регистратор,
	//	<ПсевдонимТаблицы>.Период КАК Период,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ДЕНЬ) КАК ПериодДень,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ДЕКАДА) КАК ПериодДекада,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, МЕСЯЦ) КАК ПериодМесяц,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, КВАРТАЛ) КАК ПериодКвартал,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ГОД) КАК ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//{УПОРЯДОЧИТЬ ПО
	//	<ПсевдонимПоля>.*,
	//	<ПсевдонимПоказателя>,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//УПОРЯДОЧИТЬ_СВОЙСТВА
	//	//УПОРЯДОЧИТЬ_КАТЕГОРИИ
	//}
	//ИТОГИ
	//	АГРЕГАТНАЯ_ФУНКЦИЯ(<ПсевдонимПоказателя>)
	//	//ИТОГИ_СВОЙСТВА
	//	//ИТОГИ_КАТЕГОРИИ
	//ПО
	//	ОБЩИЕ
	//{ИТОГИ ПО
	//	<ПсевдонимПоля>.*,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//АВТОУПОРЯДОЧИВАНИЕ

	Текст = 
		  "ВЫБРАТЬ Разрешенные
		  |	НДС.Организация КАК Организация,
		  |	НДС.ДоговорКонтрагента.Владелец КАК Контрагент,
		  |	НДС.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
		  |	НДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |	НДС.Сделка КАК Сделка,
		  |	ВЫБОР КОГДА НДС.ВозвратнаяТара = ИСТИНА ТОГДА ""Возвратная тара"" ИНАЧЕ ""Товары"" КОНЕЦ КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.НалоговоеНазначение,
		  |	НДС.Регистратор,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДСПропорционально
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйСуммаНДСПропорционально,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.СуммаНДСПропорционально
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйСуммаНДСПропорционально,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ -НДС.БазаНДС
		  |	КОНЕЦ КАК НеПодтвержденныйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ -НДС.СуммаНДС
		  |	КОНЕЦ КАК НеПодтвержденныйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДСПропорционально
		  |		ИНАЧЕ -НДС.СуммаНДСПропорционально
		  |	КОНЕЦ КАК НеПодтвержденныйСуммаНДСПропорционально
		  |{ВЫБРАТЬ
		  |	Организация.*,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	Сделка.*,
		  |	НДС.НалоговоеНазначение.*,
		  |	ОжидаемыйБазаНДС,
		  |	ОжидаемыйСуммаНДС,
		  |	ПодтвержденныйБазаНДС,
		  |	ПодтвержденныйСуммаНДС,
		  |	НеПодтвержденныйБазаНДС,
		  |	НеПодтвержденныйСуммаНДС,
		  |	ОжидаемыйСуммаНДСПропорционально,
		  |	ПодтвержденныйСуммаНДСПропорционально,
		  |	НеПодтвержденныйСуммаНДСПропорционально,
		  | Регистратор
		  |}
		  |ИЗ
		  |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК НДС
		  |
		  |ГДЕ НДС.Период >= &ДатаНачала 
		  |  И НДС.Период <= &ДатаКонца
		  |
		  |{ГДЕ
		  |	Организация.*,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	Сделка.*,
		  |	НДС.ДоговорКонтрагента.ВалютаВзаиморасчетов.*,
		  |	НДС.ВозвратнаяТара КАК ВозвратнаяТара,
		  | НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.НалоговоеНазначение.*}
  		  |УПОРЯДОЧИТЬ ПО
		  | СобытиеНДС
		  |{УПОРЯДОЧИТЬ ПО
		  |	СобытиеНДС,
		  |	Организация.*,
		  |	Контрагент.*,
		  |	ДоговорКонтрагента.*}
		  |ИТОГИ
		  |	СУММА(ОжидаемыйСуммаНДС),
		  |	СУММА(ОжидаемыйБазаНДС),
		  |	СУММА(ПодтвержденныйСуммаНДС),
		  |	СУММА(ПодтвержденныйБазаНДС),
		  |	СУММА(НеПодтвержденныйСуммаНДС),
		  |	СУММА(НеПодтвержденныйБазаНДС),
		  |	СУММА(ОжидаемыйСуммаНДСПропорционально),
		  |	СУММА(ПодтвержденныйСуммаНДСПропорционально),
		  |	СУММА(НеПодтвержденныйСуммаНДСПропорционально)
		  |ПО
		  |	Организация,
		  |	Валюта,
		  |	Контрагент,
		  | Сделка,
		  | ДоговорКонтрагента,
		  | ВозвратнаяТара,
		  | СтавкаНДС,
		  | НалоговоеНазначение
		  |
		  |{ИТОГИ ПО
		  |	Организация.*,
		  |	Валюта,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	Сделка.*,
		  |	ВЫБОР КОГДА НДС.ВозвратнаяТара = ИСТИНА ТОГДА ""Возвратная тара"" ИНАЧЕ ""Товары"" КОНЕЦ КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.НалоговоеНазначение.*,
		  | НДС.Регистратор
		  |}";
 

	УниверсальныйОтчет.ПостроительОтчета.Текст = Текст;
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Приход", 						ВидДвиженияНакопления.Приход);
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация",				"Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент", 				"Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сделка", 					"Сделка");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента",		"Договор");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВозвратнаяТара", 			"Расчеты по таре");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СобытиеНДС",				"Вид расчетов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Валюта",					"Валюта взаиморасчетов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтавкаНДС", 				"Ставка НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НалоговоеНазначение", 	"Налоговое назначение");
	
	
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйБазаНДС",  "База НДС", ИСТИНА,   "ЧЦ = 15; ЧДЦ = 3", "ОжидаемыйНДС", "Ожидаемый НДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйСуммаНДС", "НДС", ИСТИНА,   "ЧЦ = 15; ЧДЦ = 3", "ОжидаемыйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйБазаНДС", "База НДС", ИСТИНА,   "ЧЦ = 15; ЧДЦ = 3", "ПодтвержденныйНДС", "Подтвержденный НДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйСуммаНДС", "НДС", ИСТИНА,   "ЧЦ = 15; ЧДЦ = 3", "ПодтвержденныйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйБазаНДС", "База НДС", ИСТИНА,   "ЧЦ = 15; ЧДЦ = 3", "НеПодтвержденныйНДС", "Не подтвержденный НДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйСуммаНДС", "НДС", ИСТИНА,   "ЧЦ = 15; ЧДЦ = 3", "НеПодтвержденныйНДС");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйСуммаНДСПропорционально", 			"НДС (пропорц.)", 		Ложь, "ЧЦ=15; ЧДЦ=2", "ОжидаемыйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйСуммаНДСПропорционально", 	    "НДС (пропорц.)", 		Ложь, "ЧЦ=15; ЧДЦ=2", "ПодтвержденныйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйСуммаНДСПропорционально", 	"НДС (пропорц.)", 		Ложь, "ЧЦ=15; ЧДЦ=2", "НеПодтвержденныйНДС");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);

	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Очистить();
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Валюта");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДоговорКонтрагента");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Сделка");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтавкаНДС");
	//
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	УниверсальныйОтчет.ДобавитьИзмерениеКолонки("СобытиеНДС");
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("СобытиеНДС");

	//// Удалим добавляемые автоматически поля измерений
	//Сч=0;
	//Пока Сч < УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля.Количество() Цикл

	//	Если (УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти(УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля[Сч].Имя)<>Неопределено)
	//	 ИЛИ (УниверсальныйОтчет.ПостроительОтчета.ИзмеренияКолонки.Найти(УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля[Сч].Имя)<>Неопределено) Тогда
	//		УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля.Удалить(УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля[Сч]);
	//	Иначе
	//		Сч=Сч+1;
	//	КонецЕсли;

	//КонецЦикла;
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

КонецПроцедуры // УстановитьНачальныеНастройки()

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//  ДокументРезультат - табличный документ, формируемый отчетом,
//  ПоказыватьЗаголовок - флаг того, показывать заголовок или скрывать его
//  ВысотаЗаголовка - возращаемое значение - высота заголовка
//  ТолькоЗаголовок - флаг того, сформировать только заголовок или весь отчет
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.СформироватьОтчет(ДокументРезультат);
	
КонецПроцедуры

Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно перередать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

#КонецЕсли

УниверсальныйОтчет.мРежимВводаПериода = 4; //месяц
